{
  "recipes": [
    {
      "id": 1,
      "name": "French Omelette",
      "image": "https://images.squarespace-cdn.com/content/v1/5008a3c6c4aa6450352d2303/1559825825215-45WIYRRIQW2CSARR5LN4/IMG_20190602_133940-01.jpeg?format=2500w",
      "description": "A mouthwatering French omelette, delightfully fluffy and filled with a savory blend of fresh herbs and melted cheese.",
      "ingredients": "2 eggs | 2 tbs milk | 1 tbs unsalted butter | cheese of choice, | salt and pepper to taste",
      "allergens": "Eggs | milk",
      "steps": "1. Combine the eggs, milk, salt, and pepper in a medium bowl and mix very well with a fork or a whisk. | 2. Set a plate by the stove, and heat a small (about 6 inches) seasoned omelette pan or non-stick skillet over medium-high heat. | 3. Swirl the pan to distribute the butter as it melts, when  the foam subsides add the eggs, stir vigorously, add cheese in center. | 4. Hold the pan at a 45-degree angle to the stove and carefully fold the omelette. | 5. Cook just until the desired degree of doneness.",
      "category": "breakfast",
      "preptime": 10,
      "cooktime": 5,
      "servings": 1,
      "stars": 0,
      "ratings": 0
    },
    {
      "id": 2,
      "name": "The Easy Chicken Salad Recipe You Should Know By Heart",
      "image": "https://www.milkandhoneynutrition.com/wp-content/uploads/2021/09/Chicken-salad-with-grapes-and-walnuts-1-scaled.jpeg",
      "description": "Who doesn't love a fresh and easy chicken salad recipe? With the perfect blend of creamy and crunchy, this lunchtime staple can be enjoyed on its own, over greens or sandwiched between two slices of crusty bread. While you can buy premade varieties at the store, nothing tops the flavor of homemade chicken salad. It's also a yummy way to use up last night's leftover chicken.",
      "ingredients": "1/2 cup mayonnaise | 2 tablespoons sour cream | 1 tablespoon lemon juice | 4 cups shredded rotisserie chicken | 1 + 1/4 cups seedless red grapes, halved | 1/2 cup chopped pecans | 1/2 cup chopped celery | salt and pepper to taste | 1/4 cup chopped sweet onion, optional | lettuce leaves or whole wheat bread slices, optional",
      "allergens": "Eggs | dairy | tree nuts",
      "steps": "1. Start by mixing the first five ingredients together for a creamy sauce. The sour cream and lemon juice add a tangy kick to this chunky chicken salad. Whisk together the mayonnaise, sour cream, lemon juice, salt and pepper until fully combined, tasting as you go, then set aside. | 2. In a large bowl, mix together the shredded chicken, halved red grapes, chopped pecans and chopped celery. If using onion, add it along with your mayonnaise sauce. Toss to coat. | 3. Once your chicken salad is combined, serve with fresh homemade bread, mixed greens salad or whole-grain crackers. Store leftovers in a sealed container in the refrigerator right away.",
      "category": "lunch",
      "preptime": 15,
      "cooktime": 2,
      "servings": 1,
      "stars": 0,
      "ratings": 0
    },
    {
      "id": 3,
      "name": "Thai Style Green Coconut Curry",
      "image": "https://cdn.pickuplimes.com/cache/fd/dd/fddd155daea4e59501f2d84e8c5ad6d4.jpg",
      "description": "This curry is a spicy one! Curries can be found all over the world, but green curry originates from central Thailand. In our time travelling through Thailand, we enjoyed curries for breakfast, lunch, and dinner without ever tiring of it. Green chillies are used to create the curry paste, so it packs quite a bit of heat along with its intense and bold flavours.",
      "ingredients": "ingredient_list",
      "allergens": "Peanuts | tree nuts | sesame | soy | gluten",
      "steps": "1. Add the oil to a large pan on medium-high heat. When hot, add the tofu and sprinkle with salt. Cook until golden on all sides, about 8 - 10 minutes. | 2. Meanwhile, add the green broth ingredients to a blender. Blend until smooth. | 3. Add the rice noodles to a large bowl and pour boiling water over top to submerge. Drain after 2 minutes once the noodles are al dente* and rinse under warm water. Divide the noodles into your bowls. | 4. Once the tofu is golden and crispy on all sides, transfer to a bowl and set aside. | 5. Return the same pan to heat and add the oil. When hot, add the garlic and shallots and cook until lightly golden, about 3 minutes.",
      "category": "dinner",
      "preptime": 25,
      "cooktime": 30,
      "servings": 4,
      "stars": 0,
      "ratings": 0
    }
  ],
  "comments": [
    {
      "comment": "",
      "username": "",
      "hearts": 0,
      "refno": 0,
      "id": 1
    },
    {
      "comment": "This looks like a blog! ",
      "username": "Tiffany",
      "refno": 2,
      "id": 2
    },
    {
      "comment": "Hello!",
      "username": "Tiffany",
      "refno": 1,
      "id": 3
    },
    {
      "comment": "Hello",
      "username": "Tiffany",
      "refno": 2,
      "id": 4
    },
    {
      "comment": "aldfkja;l",
      "username": "fajaf",
      "refno": 2,
      "id": 5
    }
  ]
}